УчетВУправляющихДляГит1/src/Catalogs/ВидыОплатОрганизаций/ВидыОплатОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОплатОрганизаций</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБанковскойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомиссияБанка</name>
    <attributes>
      <name>СуммаОперацийОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентБанковскойКомиссии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СКомитентомНаЗакупку</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионеромНаЗакупку</name>
  </enumValues>
  <enumValues>
    <name>СФакторинговойКомпанией</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ККТ</name>
    <comment>KKT</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>ККМОфлайн</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЭтикеток</name>
    <comment>LabelPrinter</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательRFID</name>
    <comment>RFID</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьWebСервисОборудование</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ТипыОплат/ТипыОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплат</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийКредит</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификатСобственный</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификатСторонний</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <basedOn>Catalog.Организации</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОсновнойДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮрФизЛицо</name>
    <type>
      <types>EnumRef.УдалитьЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КППВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеКПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйОрган</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидГосударственногоОргана</name>
    <type>
      <types>EnumRef.ВидыГосударственныхОрганов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодГосударственногоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКонтактнойИнформации</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/ВидыОплатОрганизаций/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаголовокОрганизация = НСтр("ru = 'Организация:'");
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	УстановитьВидимостьСчетовУчета();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ПодготовитьФормуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Передадим объекту информацию о том, что запись идет из формы.
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзФормыЭлемента", Истина);
	
	КоличествоСтрокКомиссияБанка = ТекущийОбъект.КомиссияБанка.Количество();
	Если КоличествоСтрокКомиссияБанка = 0 Тогда
		ТекущийОбъект.КомиссияБанка.Добавить().ПроцентБанковскойКомиссии = ТекущийОбъект.ПроцентБанковскойКомиссии;
	ИначеЕсли КоличествоСтрокКомиссияБанка = 1 Тогда
		ТекущийОбъект.ПроцентБанковскойКомиссии = ТекущийОбъект.КомиссияБанка[0].ПроцентБанковскойКомиссии;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьДобавленнныеКолонкиТаблиц(ЭтотОбъект);
	
	ДействияСОтложеннымПроведением =
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущийОбъект.ДополнительныеСвойства, "ДействияСОтложеннымПроведением");
	
	Если ДействияСОтложеннымПроведением = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Запускаем фоновое задание по переключению режима отложенного проведения
	РезультатЗаданияПереключенияОтложенногоПроведения = ПроведениеСервер.НачатьПереключениеОтложенногоПроведения(
		ДействияСОтложеннымПроведением.Включить,
		ДействияСОтложеннымПроведением.Отключить,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если РезультатЗаданияПереключенияОтложенногоПроведения <> Неопределено Тогда
		ПроведениеКлиент.ОжидатьПереключенияОтложенногоПроведения(РезультатЗаданияПереключенияОтложенногоПроведения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОплатыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ТипОплаты) Тогда
		ТипОплатыПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = ЗначенияЗаполненияИзПараметровВыбора(Элементы.Контрагент);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Объект.Контрагент);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = ЗначенияЗаполненияИзПараметровВыбора(Элементы.ДоговорКонтрагента);
	
	ЗначенияЗаполнения.Вставить("Владелец",    Объект.Контрагент);
	ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Объект.ДоговорКонтрагента);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ПараметрыДоговора = Новый Структура;
	ПараметрыДоговора.Вставить("Организация", Объект.Организация);
	ПараметрыДоговора.Вставить("Владелец", Объект.Контрагент);
	ПараметрыДоговора.Вставить("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
	
	РаботаСДоговорамиКонтрагентовБПКлиент.ДоговорОбработкаВыбора(Элемент, ВыбранноеЗначение, ПараметрыДоговора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	РаботаСДоговорамиКонтрагентовБПКлиент.ЗаполнитьСписокВыбора(Элемент, Текст, ПредлагатьНовыйДоговор, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	Если ПредлагатьНовыйДоговор И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		ПредлагатьНовыйДоговор = Ложь;
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемоеОборудованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтбора = Новый Структура("Организация, ТипОборудования", Объект.Организация, ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал"));
	
	ПараметрыФормыВыбора = Новый Структура("Отбор, Заголовок", СтруктураОтбора, НСтр("ru='Выберите эвайринговый терминал'", "ru") );
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаВыбораИзСписка", ПараметрыФормыВыбора, Элементы.ПодключаемоеОборудование,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПроцентБанковскойКомиссииПриИзменении(Элемент)
	
	Если Объект.ПроцентБанковскойКомиссии = 0 Тогда
		Объект.КомиссияБанка.Очистить();
	Иначе
		Объект.КомиссияБанка.Очистить();
		Объект.КомиссияБанка.Добавить().ПроцентБанковскойКомиссии = Объект.ПроцентБанковскойКомиссии;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависитОтСуммыОперацийПриИзменении(Элемент)
	
	Объект.КомиссияБанка.Очистить();
	Объект.КомиссияБанка.Добавить().ПроцентБанковскойКомиссии = Объект.ПроцентБанковскойКомиссии;
	Если ЗависитОтСуммыОпераций = 1 Тогда
		ЗаполнитьДобавленнныеКолонкиТаблиц(ЭтотОбъект);
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыКомиссияБанка

&НаКлиенте
Процедура КомиссияБанкаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ЗаполнитьДобавленнныеКолонкиТаблиц(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияБанкаПослеУдаления(Элемент)
	
	ЗаполнитьДобавленнныеКолонкиТаблиц(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияБанкаПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.НомерСтроки = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияБанкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	// Видимость по умолчанию
	ВидимостьРеквизитовБезналичнойОплаты = Истина;
	ВидимостьКомиссииБанка               = Истина;
	ВидимостьПодключаемоеОборудование    = Ложь;
	
	ЗаголовокСчетаРасчетов = НСтр("ru = 'Счет расчетов:'");
	
	Если Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплат.Наличные") Тогда
		ВидимостьРеквизитовБезналичнойОплаты = Ложь;
	ИначеЕсли Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплат.ПлатежнаяКарта") Тогда
		Элементы.Контрагент.ПодсказкаВвода = "Банк-плательщик";
		ВидимостьПодключаемоеОборудование = Истина;
	ИначеЕсли Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплат.БанковскийКредит") Тогда
		Элементы.Контрагент.ПодсказкаВвода = "Банк-кредитор";
	ИначеЕсли Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплат.ПодарочныйСертификатСторонний") Тогда
		Элементы.Контрагент.ПодсказкаВвода = "Эмитент подарочных сертификатов";
		ВидимостьКомиссииБанка = Ложь;
	ИначеЕсли Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплат.ПодарочныйСертификатСобственный") Тогда
		Элементы.Контрагент.ПодсказкаВвода = "Обобщенный покупатель, например: ""Розничный покупатель"" или ""Частное лицо""";
		ВидимостьКомиссииБанка = Ложь;
		ЗаголовокСчетаРасчетов = НСтр("ru = 'Счет авансов:'");
	КонецЕсли;
	
	Элементы.БезналичнаяОплата.Видимость        = ВидимостьРеквизитовБезналичнойОплаты;
	Элементы.ПодключаемоеОборудование.Видимость = ВидимостьПодключаемоеОборудование;
	Элементы.БанковскаяКомиссия.Видимость       = ВидимостьКомиссииБанка;
	
	ЗаголовокСчетРасчетов = ЗаголовокСчетаРасчетов;
	
	Элементы.ДоговорКонтрагента.Доступность     = ЗначениеЗаполнено(Объект.Организация)
		И ЗначениеЗаполнено(Объект.Контрагент);
	
	Элементы.БанковскаяКомиссияТарифы.Видимость = ЗависитОтСуммыОпераций = 1;
	Элементы.БанковскаяКомиссияОдноЗначение.Доступность = ЗависитОтСуммыОпераций = 0;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	Если Параметры.Свойство("ТипОплатыДоступныеЗначения") Тогда
		Элементы.ТипОплаты.СписокВыбора.ЗагрузитьЗначения(Параметры.ТипОплатыДоступныеЗначения);
	ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
		
		Если Параметры.ЗначенияЗаполнения.Свойство("ТипОплаты") Тогда
			
			Элементы.ТипОплаты.СписокВыбора.Очистить();
			
			Если ТипЗнч(Параметры.ЗначенияЗаполнения.ТипОплаты) = Тип("ФиксированныйМассив") Тогда
			
				Для ИндексОтбора = 0 по Параметры.ЗначенияЗаполнения.ТипОплаты.Количество() - 1 Цикл
					
					Если Параметры.ЗначенияЗаполнения.ТипОплаты[ИндексОтбора] = Перечисления.ТипыОплат.ПлатежнаяКарта Тогда
						Элементы.ТипОплаты.СписокВыбора.Вставить(0, Параметры.ЗначенияЗаполнения.ТипОплаты[ИндексОтбора]);
					Иначе
						Элементы.ТипОплаты.СписокВыбора.Добавить(Параметры.ЗначенияЗаполнения.ТипОплаты[ИндексОтбора]);
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				Элементы.ТипОплаты.СписокВыбора.Добавить(Параметры.ЗначенияЗаполнения.ТипОплаты);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.ТипОплаты.СписокВыбора.Количество() = 0 Тогда
		
		Элементы.ТипОплаты.СписокВыбора.Добавить(Перечисления.ТипыОплат.ПлатежнаяКарта);
		Элементы.ТипОплаты.СписокВыбора.Добавить(Перечисления.ТипыОплат.БанковскийКредит);
		
		Если ПолучитьфункциональнуюОпцию("ИспользуютсяПодарочныеСертификаты") Тогда
			
			Элементы.ТипОплаты.СписокВыбора.Добавить(Перечисления.ТипыОплат.ПодарочныйСертификатСобственный);
			
			Если ПолучитьфункциональнуюОпцию("ОсуществляетсяРеализацияТоваровУслугКомитентов") Тогда
				Элементы.ТипОплаты.СписокВыбора.Добавить(Перечисления.ТипыОплат.ПодарочныйСертификатСторонний);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Контрагент.Видимость         = ПравоДоступа("Просмотр", Метаданные.Справочники.Контрагенты);
	Элементы.ДоговорКонтрагента.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ДоговорыКонтрагентов);
	
	УстановитьПараметрыВыбораКонтрагента();
	УстановитьПараметрыВыбораДоговора();
	ЗависитОтСуммыОпераций = ?(Объект.КомиссияБанка.Количество() < 2, 0, 1);
	ЗаполнитьДобавленнныеКолонкиТаблиц(ЭтотОбъект);
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	ДоступныеВидыДоговоров = Справочники.ВидыОплатОрганизаций.ВидыДоговоровПоТипуОплаты(Объект.ТипОплаты);
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(Объект.ДоговорКонтрагента,
		Объект.Контрагент, Объект.Организация, ДоступныеВидыДоговоров);
		
	ПредлагатьНовыйДоговор = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента)
		И ДоступныеВидыДоговоров.Найти(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) <> Неопределено
		И РаботаСДоговорамиКонтрагентовБП.ПредлагатьНовыйДоговор(Объект.Организация, Объект.Контрагент) Тогда
		
		ПредлагатьНовыйДоговор = Истина;
		
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ДоступныеВидыДоговоров = Справочники.ВидыОплатОрганизаций.ВидыДоговоровПоТипуОплаты(Объект.ТипОплаты);
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(Объект.ДоговорКонтрагента,
		Объект.Контрагент, Объект.Организация, ДоступныеВидыДоговоров);
		
	ПредлагатьНовыйДоговор = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) 
		И ДоступныеВидыДоговоров.Найти(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) <> Неопределено
		И РаботаСДоговорамиКонтрагентовБП.ПредлагатьНовыйДоговор(Объект.Организация, Объект.Контрагент) Тогда
		
		ПредлагатьНовыйДоговор = Истина;
		
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ТипОплатыПриИзмененииНаСервере()
	
	УстановитьПараметрыВыбораКонтрагента();
	УстановитьПараметрыВыбораДоговора();
	
	Если ЗначениеЗаполнено(Объект.Контрагент)
		И Объект.ТипОплаты = Перечисления.ТипыОплат.ПодарочныйСертификатСобственный Тогда
		
		// для собственных сертификатов контрагент может быть только физлицом
		ВидТекущегоКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Объект.Контрагент, "ЮридическоеФизическоеЛицо");
		
		Если ВидТекущегоКонтрагента <> Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
	ДоступныеВидыДоговоров = Справочники.ВидыОплатОрганизаций.ВидыДоговоровПоТипуОплаты(Объект.ТипОплаты);
	ВидТекущегоДоговора    = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДоговорКонтрагента, "ВидДоговора");
	Если ДоступныеВидыДоговоров.Найти(ВидТекущегоДоговора) = Неопределено Тогда
		Объект.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(Объект.ДоговорКонтрагента,
		Объект.Контрагент, Объект.Организация, ДоступныеВидыДоговоров);
	
	УстановитьСчетУчетаРасчетовПоУмолчанию();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораКонтрагента()
	
	Если НЕ ПравоДоступа("Просмотр", Метаданные.Справочники.Контрагенты) Тогда
		Возврат;
	КонецЕсли; 
	
	Если Объект.ТипОплаты = Перечисления.ТипыОплат.ПодарочныйСертификатСобственный Тогда
		// Собственный сертификат может быть выдан только обобщенному физическому лицу.
		ДоступныеВидыКонтрагента = 
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
	
		ПараметрВыбораКонтрагента = Новый ПараметрВыбора(
			"Отбор.ЮридическоеФизическоеЛицо", Новый ФиксированныйМассив(ДоступныеВидыКонтрагента));
	
		НовыйМассивПараметров = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрВыбораКонтрагента);
		Элементы.Контрагент.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассивПараметров);
	Иначе
		// Очистим параметры выбора.
		Элементы.Контрагент.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДоговора()
	
	Если НЕ ПравоДоступа("Просмотр", Метаданные.Справочники.ДоговорыКонтрагентов) Тогда
		Возврат;
	КонецЕсли; 
	
	ДоступныеВидыДоговоров    = Справочники.ВидыОплатОрганизаций.ВидыДоговоровПоТипуОплаты(Объект.ТипОплаты);
	ПараметрВыбораВидДоговора = Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(ДоступныеВидыДоговоров));
	
	ПараметрВыбораВалютный = Новый ПараметрВыбора("Отбор.Валютный", Ложь);
	
	НовыйМассивПараметров = Новый Массив;
	НовыйМассивПараметров.Добавить(ПараметрВыбораВидДоговора);
	НовыйМассивПараметров.Добавить(ПараметрВыбораВалютный);
	
	Элементы.ДоговорКонтрагента.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассивПараметров);
	
	ПредлагатьНовыйДоговор = ДоступныеВидыДоговоров.Найти(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) <> Неопределено
		И РаботаСДоговорамиКонтрагентовБП.ПредлагатьНовыйДоговор(Объект.Организация, Объект.Контрагент);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСчетУчетаРасчетовПоУмолчанию()
	
	Объект.СчетУчетаРасчетов = Справочники.ВидыОплатОрганизаций.СчетУчетаРасчетовПоУмолчанию(Объект.ТипОплаты);
	
КонецПроцедуры

&НаКлиенте
Функция ЗначенияЗаполненияИзПараметровВыбора(Элемент)
	
	ЗначенияЗаполнения = Новый Структура;
	
	ПараметрыВыбораПоля = Новый Массив(Элемент.ПараметрыВыбора);
	Для каждого ПараметрВыбора Из ПараметрыВыбораПоля Цикл
		Если СтрНайти(ПараметрВыбора.Имя, "Отбор.") > 0 Тогда
			ИмяОтбора = СтрЗаменить(ПараметрВыбора.Имя, "Отбор.", "");
			ЗначенияЗаполнения.Вставить(ИмяОтбора, ПараметрВыбора.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначенияЗаполнения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДобавленнныеКолонкиТаблиц(Форма)
	
	Объект = Форма.Объект;
	
	Объект.КомиссияБанка.Сортировать("СуммаОперацийОт");
	КоличествоСтрок = Объект.КомиссияБанка.Количество();
	
	ГраницаСуммыОпераций = 0;
	Для сч = 1 По КоличествоСтрок Цикл
		СтрокаТаблицы = Объект.КомиссияБанка[КоличествоСтрок - сч];
		Если КоличествоСтрок = 1 Тогда
			ШаблонСтроки = НСтр("ru = 'Комиссия %1% (не зависит от суммы операций)'");
			СтрокаТаблицы.УсловияБанка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСтроки, СтрокаТаблицы.ПроцентБанковскойКомиссии);
			Прервать;
		КонецЕсли;
		
		Если СтрокаТаблицы.НомерСтроки = КоличествоСтрок Тогда
			ШаблонСтроки = НСтр("ru = 'Свыше %1 руб. - комиссия %2%'");
			СтрокаТаблицы.УсловияБанка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСтроки, СтрокаТаблицы.СуммаОперацийОт, СтрокаТаблицы.ПроцентБанковскойКомиссии);
		ИначеЕсли СтрокаТаблицы.НомерСтроки = 1 Тогда
			ШаблонСтроки = НСтр("ru = 'До %1 руб. включительно - комиссия %2%'");
			СтрокаТаблицы.УсловияБанка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСтроки, ГраницаСуммыОпераций, СтрокаТаблицы.ПроцентБанковскойКомиссии);
		Иначе
			ШаблонСтроки = НСтр("ru = 'От %1 до %2 руб. включительно - комиссия %3%'");
			СтрокаТаблицы.УсловияБанка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСтроки, СтрокаТаблицы.СуммаОперацийОт, ГраницаСуммыОпераций, СтрокаТаблицы.ПроцентБанковскойКомиссии);
		КонецЕсли;
		
		ГраницаСуммыОпераций = СтрокаТаблицы.СуммаОперацийОт;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСчетовУчета()
	
	ЭлементыСчетов = Новый Массив();
	ЭлементыСчетов.Добавить("ЗаголовокСчетРасчетов");
	ЭлементыСчетов.Добавить("СчетУчетаРасчетов");
	
	СчетаУчетаВДокументах.УстановитьВидимостьСчетовУчета(Элементы, ЭлементыСчетов);
	
КонецПроцедуры

#Область УсловноеОформление

&НаСервере
Процедура УстановитьУсловноеОформление() Экспорт
	
	УсловноеОформление.Элементы.Очистить();
	
	УстановитьУсловноеОформлениеКомиссияБанка();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеКомиссияБанка() Экспорт
	
	//Объект.КомиссияБанка.СуммаОперацийОт
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КомиссияБанкаСуммаОпераций");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ЭлементУО.Отбор,
		"Объект.КомиссияБанка.НомерСтроки",
		ВидСравненияКомпоновкиДанных.Равно,
		1);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ЭлементУО.Отбор,
		"Объект.КомиссияБанка.СуммаОперацийОт",
		ВидСравненияКомпоновкиДанных.Равно,
		0);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "0");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//Объект.КомиссияБанка.СуммаОперацийОт
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КомиссияБанкаСуммаОпераций");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ЭлементУО.Отбор,
		"Объект.КомиссияБанка.НомерСтроки",
		ВидСравненияКомпоновкиДанных.Больше,
		1);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ЭлементУО.Отбор,
		"Объект.КомиссияБанка.СуммаОперацийОт",
		ВидСравненияКомпоновкиДанных.Равно,
		0);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	//Объект.КомиссияБанка.От
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "0");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КомиссияБанкаТекстОт");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ЭлементУО.Отбор,
		"Объект.КомиссияБанка.НомерСтроки",
		ВидСравненияКомпоновкиДанных.Заполнено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "от");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
